nevinxu/HM502B2/platform/hal/sim/MKL27Z4/fsl_sim_hal_KL27Z4.c
    switch (instance)
    {
    case 0:
        retValue =  BR_SIM_SCGC4_SPI0(baseAddr);
        break;
    case 1:
        retValue =  BR_SIM_SCGC4_SPI1(baseAddr);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableI2cClock
 * Description   : Enable the clock for I2C module
 * This function enables the clock for I2C moudle
 *
 *END**************************************************************************/
void SIM_HAL_EnableI2cClock(uint32_t baseAddr, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        BW_SIM_SCGC4_I2C0(baseAddr, 1);
        break;
    case 1:
        BW_SIM_SCGC4_I2C1(baseAddr, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableI2cClock
 * Description   : Disable the clock for I2C module
 * This function disables the clock for I2C moudle
 *
 *END**************************************************************************/
void SIM_HAL_DisableI2cClock(uint32_t baseAddr, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        BW_SIM_SCGC4_I2C0(baseAddr, 0);
        break;
    case 1:
        BW_SIM_SCGC4_I2C1(baseAddr, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetI2cGateCmd
 * Description   : Get the the clock gate state for I2C module
 * This function will get the clock gate state for I2C moudle.
 *
 *END**************************************************************************/
bool SIM_HAL_GetI2cGateCmd(uint32_t baseAddr, uint32_t instance)
{
    bool retValue = false;

    switch (instance)
    {
    case 0:
        retValue =  BR_SIM_SCGC4_I2C0(baseAddr);
        break;
    case 1:
        retValue =  BR_SIM_SCGC4_I2C1(baseAddr);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableLpuartClock
 * Description   : Enable the clock for LPUART module
 * This function enables the clock for LPUART moudle
 *
 *END**************************************************************************/
void SIM_HAL_EnableLpuartClock(uint32_t baseAddr, uint32_t instance)
{  
    switch (instance)
    {
    case 0:
        BW_SIM_SCGC5_LPUART0(baseAddr, 1);
        break;
    case 1:
        BW_SIM_SCGC5_LPUART1(baseAddr, 1);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableLpuartClock
 * Description   : Disable the clock for LPUART module
 * This function disables the clock for LPUART moudle
 *
 *END**************************************************************************/
void SIM_HAL_DisableLpuartClock(uint32_t baseAddr, uint32_t instance)
{
    switch (instance)
    {
    case 0:
        BW_SIM_SCGC5_LPUART0(baseAddr, 0);
        break;
    case 1:
        BW_SIM_SCGC5_LPUART1(baseAddr, 0);
        break;
    default:
        break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetLpuartGateCmd
 * Description   : Get the the clock gate state for LPUART module
 * This function will get the clock gate state for LPUART moudle.
 *
 *END**************************************************************************/
bool SIM_HAL_GetLpuartGateCmd(uint32_t baseAddr, uint32_t instance)
{
    bool retValue = false;

    switch (instance)
    {
    case 0:
        retValue =  BR_SIM_SCGC5_LPUART0(baseAddr);
        break;
    case 1:
        retValue =  BR_SIM_SCGC5_LPUART1(baseAddr);
        break;
    default:
        retValue =  false;
        break;
    }

    return retValue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableUartClock
 * Description   : Enable the clock for UART module
 * This function enables the clock for UART moudle
 *
 *END**************************************************************************/
void SIM_HAL_EnableUartClock(uint32_t baseAddr, uint32_t instance)
{
    BW_SIM_SCGC4_UART2(baseAddr, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableUartClock
 * Description   : Disable the clock for UART module
 * This function disables the clock for UART moudle
 *
 *END**************************************************************************/
void SIM_HAL_DisableUartClock(uint32_t baseAddr, uint32_t instance)
{
    BW_SIM_SCGC4_UART2(baseAddr, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetUartGateCmd
 * Description   : Get the the clock gate state for UART module
 * This function will get the clock gate state for UART moudle.
 *
 *END**************************************************************************/
bool SIM_HAL_GetUartGateCmd(uint32_t baseAddr, uint32_t instance)
{
    return BR_SIM_SCGC4_UART2(baseAddr);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableFlexioClock
 * Description   : Enable the clock for FLEXIO module
 * This function enables the clock for FLEXIO moudle
 *
 *END**************************************************************************/
void SIM_HAL_EnableFlexioClock(uint32_t baseAddr, uint32_t instance)
{
    BW_SIM_SCGC5_FLEXIO(baseAddr, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableFlexioClock
 * Description   : Disable the clock for FLEXIO module
 * This function disables the clock for FLEXIO moudle
 *
 *END**************************************************************************/
void SIM_HAL_DisableFlexioClock(uint32_t baseAddr, uint32_t instance)
{
    BW_SIM_SCGC5_FLEXIO(baseAddr, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetFlexioGateCmd
 * Description   : Get the the clock gate state for FLEXIO module
 * This function will get the clock gate state for FLEXIO moudle.
 *
 *END**************************************************************************/
bool SIM_HAL_GetFlexioGateCmd(uint32_t baseAddr, uint32_t instance)
{
    return BR_SIM_SCGC5_FLEXIO(baseAddr);
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

